---
kind: property
id: P:Autodesk.Revit.DB.Visual.Tile.TextureRealWorldOffsetX
source: html/4ccf926e-2426-3c5a-af51-f1690f4878f8.htm
---
# Autodesk.Revit.DB.Visual.Tile.TextureRealWorldOffsetX Property

The property labeled "Offset X" from the "Tile" schema.

## Syntax (C#)
```csharp
public static string TextureRealWorldOffsetX { get; }
```

## Remarks
This property is of type "AssetPropertyDistance".